<?php
// Задания 20-22:
// 20) Найдите с помощью цикла сумму корней чисел от 1 до 15. Результат округлите до двух знаков.
// 21) Найдите с помощью цикла сумму квадратов чисел от 1 до 15.
// 22) Напишите скрипт, который находит факториал числа.

$var1 = 0;
for ($var2 = 1; $var2 <= 15; $var2++) {
    $var1 += sqrt($var2);
}
echo "20) Сумма корней: " . round($var1, 2) . "<br>";

$var3 = 0;
for ($var2 = 1; $var2 <= 15; $var2++) {
    $var3 += $var2 ** 2;
}
echo "21) Сумма квадратов: $var3<br>";

$var4 = 6;
$var5 = 1;
for ($var2 = 1; $var2 <= $var4; $var2++) {
    $var5 *= $var2;
}
echo "22) Факториал $var4 = $var5<br>";
