<?php
// Задания 1-3:
// 1) Создайте переменную $num и присвойте ей значение 123. Выведите значение этой переменной на экран с помощью команды echo.
// 2) Создайте переменную $a. Запишите в нее значение 10, выведите его на экран. Затем запишите в нее значение 20, выведите его на экран.
// 3) Создайте переменную $a. Запишите в нее сумму чисел 1, 2 и 3. С помощью команды echo выведите на экран содержимое переменной $a.

$num = 123;
echo "1) num = $num<br>";

$a = 10;
echo "2) a = $a<br>";

$a = 20;
echo "2) a = $a (после изменения)<br>";

$a = 1 + 2 + 3;
echo "3) a = $a<br>";
