<?php
// Задание 50:
// Дан трехмерный массив. Найдите сумму элементов этого массива.

$var1 = [
    [
        [11, 12, 13],
        [14, 15, 16],
        [17, 17, 19],
    ],
    [
        [21, 22, 23],
        [24, 25, 26],
        [27, 27, 29],
    ],
    [
        [31, 32, 33],
        [34, 35, 36],
        [37, 37, 39],
    ],
];

$var2 = 0;
foreach ($var1 as $var3) {
    foreach ($var3 as $var4) {
        foreach ($var4 as $var5) {
            $var2 += $var5;
        }
    }
}

echo "50) Сумма элементов: $var2<br>";
